#+TITLE:Emacs Configuration
#+AUTHOR:Dimitar Petrov
#+STARTUP: overview

** Setting up default files
   The following sets a default target file for notes, and defines a global key for capturing new material.

#+BEGIN_SRC emacs-lisp
  ;; Set to the location of my Org files on the NFS Share
  (setq org-directory "/media/rdisk/new_tree/SelfImprover/OrgModeRepo")

  (setq org-default-notes-file (concat org-directory "/notes.org"))

  ;;(setq org-capture-templates
  ;;      '(("t" "Todo" entry (file+headline
  ;;                           (concat org-directory "/NixOrg/gtd.org") "Tasks")
  ;;         "* TODO %?\n  %i\n  %a\n")
  ;;        ("n" "Note" entry (file+headline
  ;;                           (concat org-directory "/NixOrg/notes.org") "Notes")
  ;;         "* %?\nEntered on %U\n  %i\n  %a")
  ;;        ("j" "Journal" entry (file+datetree
  ;;                              (concat org-directory "/NixOrg/journal.org"))
  ;;         "* %?\nEntered on %U\n  %i\n  %a")))

  ;; Capture templates for: TODO tasks, Notes, appointments, phone calls, meetings, and org-protocol
  (setq org-capture-templates
        (quote (("t" "Todo" entry (file+headline
                                   (concat org-directory "/NixOrg/refile.org") "Tasks")
                 "* TODO %?\n%U\n%a\n" :clock-in t :clock-resume t)
                ("r" "Respond" entry (file
                                      (concat org-directory "/NixOrg/refile.org"))
                 "* NEXT Respond to %:from on %:subject\nSCHEDULED: %t\n%U\n%a\n" :clock-in t :clock-resume t :immediate-finish t)
                ("n" "Note" entry (file+headline 
                                   (concat org-directory "/NixOrg/refile.org") "Notes")
                 "* %? :NOTE:\n%U\n%a\n" :clock-in t :clock-resume t)
                ("j" "Journal" entry (file+datetree 
                                      (concat org-directory "/NixOrg/journal.org"))
                 "* %?\nToday *ENERGY* Level: \nToday *PASSION* Level: \nToday *INTENSITY* Level: \nToday *MINDFULLNESS* Level: \n%U\n" :clock-in t :clock-resume t)
                ("w" "org-protocol" entry (file
                                           (concat org-directory "/NixOrg/refile.org"))
                 "* TODO Review %c\n%U\n" :immediate-finish t)
                ("m" "Meeting" entry (file
                                      (concat org-directory "/NixOrg/refile.org"))
                 "* MEETING with %? :MEETING:\n%U" :clock-in t :clock-resume t)
                ("p" "Phone call" entry (file
                                         (concat org-directory "/NixOrg/refile.org"))
                 "* PHONE %? :PHONE:\n%U" :clock-in t :clock-resume t)
                ("h" "Habit" entry (file+headline
                                    (concat org-directory "/NixOrg/refile.org") "Habits")
                 "* NEXT %?\n%U\n%a\nSCHEDULED: %(format-time-string \"%<<%Y-%m-%d %a .+1d/3d>>\")\n:PROPERTIES:\n:STYLE: habit\n:REPEAT_TO_STATE: NEXT\n:END:\n"))))

  ;; Set up org-mobile-directory
  (setq org-mobile-directory (concat org-directory "/MobileOrg"))

  ;; Set to the name of the file where new notes will be stored
  (setq org-mobile-inbox-for-pull (concat org-directory "/NixOrg/flagged.org"))
#+END_SRC

#+RESULTS:
: /media/rdisk/new_tree/SelfImprover/OrgModeRepo/NixOrg/flagged.org

